constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1912                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    buWall
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          2480;
        startFace       12152;
    }
    uWall
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          96;
        startFace       14632;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          64;
        startFace       14728;
    }
    chamberWall
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          96;
        startFace       14792;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          64;
        startFace       14888;
    }
    fuWall
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          2480;
        startFace       14952;
    }
    fluid_to_solid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          176;
        startFace       17432;
        sampleMode      nearestPatchFace;
        sampleRegion    solid;
        samplePatch     solid_to_fluid;
    }
)

// ************************************************************************* //
