constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1912                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    blWall
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          1276;
        startFace       6172;
    }
    iWall
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          72;
        startFace       7448;
    }
    lWall
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          96;
        startFace       7520;
    }
    oWall
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          72;
        startFace       7616;
    }
    flWall
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          1276;
        startFace       7688;
    }
    solid_to_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          176;
        startFace       8964;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_solid;
    }
)

// ************************************************************************* //
