system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
DebugSwitches
{
    compressible::alphatWallBoilingWallFunction                 0;
    compressible::turbulentTemperatureTwoPhaseRadCoupledMixed   0;
}

application     chtMultiRegionTwoPhaseEulerFoam;

startFrom       startTime;

startTime       40000;

stopAt          endTime;

endTime         50000;//5;

deltaT          0.1;//1e-6;

writeControl    adjustable;

writeInterval   100;//0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;//12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

maxCo           7.5;//0.5;

// Maximum diffusion number
maxDi           10.0;

maxDeltaT       1;//1e-3;

adjustTimeStep  yes;

functions
{
}

// ************************************************************************* //
